go-go-golems/esp32-s3-m5/0072-m5dial-timer-demo/main/m5dial_board.h
#pragma once

#include <stdint.h>

#define LGFX_USE_V1
#include <LovyanGFX.hpp>
#include <ESP32Encoder.h>

namespace tutorial_0072 {

struct TouchState {
  bool pressed = false;
  int16_t x = -1;
  int16_t y = -1;
};

enum class SwipeDirection {
  kNone = 0,
  kLeft,
  kRight,
  kUp,
  kDown,
};

class LGFX_M5Dial : public lgfx::LGFX_Device {
 public:
  LGFX_M5Dial();

 private:
  lgfx::Panel_GC9A01 panel_;
  lgfx::Bus_SPI bus_;
  lgfx::Light_PWM light_;
};

class M5DialBoard {
 public:
  bool init();
  void poll();

  LGFX_M5Dial &display() { return display_; }
  int take_encoder_steps();
  bool take_button_press();
  bool take_button_long_press();
  TouchState read_touch();
  SwipeDirection take_swipe();

 private:
  void init_power_hold();
  void init_encoder_button_gpio();
  bool init_touch_controller();
  void poll_touch();
  TouchState sample_touch();

  LGFX_M5Dial display_{};
  ESP32Encoder encoder_{};
  int encoder_last_count_ = 0;

  int encoder_steps_pending_ = 0;

  bool button_raw_state_ = true;
  bool button_stable_state_ = true;
  int64_t button_last_change_ms_ = 0;
  int64_t button_pressed_ms_ = 0;
  bool button_press_pending_ = false;
  bool button_long_press_pending_ = false;
  bool button_long_press_reported_ = false;

  bool touch_ready_ = false;
  bool touch_was_pressed_ = false;
  TouchState touch_state_{};
  TouchState touch_start_{};
  TouchState touch_last_{};
  SwipeDirection swipe_pending_ = SwipeDirection::kNone;
};

}  // namespace tutorial_0072
